module FlashMessageHelper
  def ex_up_message
    [
      "ゆうしゃのこうげき<br>1000のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのこうげき<br>かいしんのいちげき！<br>2000のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃはメラゾーマをとなえた<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃの超究武神覇斬！！<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのエース・オブ・ザ・ブリッツ！！<br>99999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのつるのむち<br>300のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのアルテマ<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃはイオナズンをとなえた<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのサイコキネシス<br>3000のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃのエンドオブハート<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃはバルスをとなえた<br>ラ◯ュタがほうかいした<br>ゆうしゃは1のけいけんちをえた<br>",
      "ゆうしゃはバハムートをしょうかんした<br>メガフレア!<br>9999のダメージをあたえた<br>本日のかだいをやっつけた<br>ゆうしゃは1のけいけんちをえた<br>"
    ].sample
  end

  def lv_down_message
    [
      "ゆうしゃはレベルが下がった…<br>ドンマイ(笑)",
      "ゆうしゃはレベルが下がった…<br>そんな日もあるさ",
      "ゆうしゃはレベルが下がった…<br>次がんばろう",
      "ゆうしゃはレベルが下がった…<br>ばんかいだぜ",
      "ゆうしゃはレベルが下がった…<br>明日があるさ"
    ].sample
  end
end
